app/Http/Controllers/User/CartController.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function index()
    {
        $user = User::findOrFail(Auth::id());

select `products`.*, `carts`.`user_id` as `pivot_user_id`, `carts`.`product_id` as `pivot_product_id`, `carts`.`id` as `pivot_id`, `carts`.`quantity` as `pivot_quantity` from `products` inner join `carts` on `products`.`id` = `carts`.`product_id` where `carts`.`user_id` = 1
select * from `carts` where `product_id` = '110' and `user_id` = 1 limit 1
insert into `carts` (`user_id`, `product_id`, `quantity`, `updated_at`, `created_at`) values (1, '110', '1', '2023-09-21 18:34:59', '2023-09-21 18:34:59')
---
    public function add(Request $request)
    {
        $itemInCart = Cart::where('product_id', $request->product_id)
        ->where('user_id', Auth::id())->first();

        if($itemInCart){
            $itemInCart->quantity += $request->quantity;
            $itemInCart->save();

        } else {
            Cart::create([
                'user_id' => Auth::id(),
                'product_id' => $request->product_id,
                'quantity' => $request->quantity
            ]);

delete from `carts` where `product_id` = '116' and `user_id` = 1
---
    public function delete($id)
    {
        Cart::where('product_id', $id)
        ->where('user_id', Auth::id())
        ->delete();

select * from `users` where `users`.`id` = 1 limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 110
---
    public function checkout()
    {
        $user = User::findOrFail(Auth::id());
        $products = $user->products;
        $stripe = new \Stripe\StripeClient(env('STRIPE_SECRET_KEY'));

        $lineItems = [];
        foreach($products as $product) {
            $quantity = '';
            $quantity = Stock::where('product_id', $product->id)->sum('quantity');

insert into `t_stocks` (`product_id`, `type`, `quantity`, `updated_at`, `created_at`) values (110, '2', -1, '2023-09-23 00:34:02', '2023-09-23 00:34:02')
---
        // dd($lineItems);
        // ストライプに渡す前に在庫を減らす
        foreach($products as $product){
            Stock::create([
                'product_id' => $product->id,
                'type' => \Constant::PRODUCT_LIST['reduce'],
                'quantity' => $product->pivot->quantity * -1,
            ]);