app/Http/Controllers/Owner/ImageController.php

select * from `images` where `images`.`id` = '1' limit 1
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
---
    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {
            //dd($request->route()->parameter('shop'));
            //dd(Auth::id());

            $id = $request->route()->parameter('image');
            if(!is_null($id)){
            $imagesOwnerId = Image::findOrFail($id)->owner->id;

select * from `images` where `owner_id` = 1 order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `images` where `owner_id` = 1
---
    public function index()
    {
        $images = Image::where('owner_id',Auth::id())
        ->orderBy('updated_at','desc')
        ->paginate(20);

insert into `images` (`owner_id`, `filename`, `updated_at`, `created_at`) values (1, '342273673_65000c34349cd.jpg', '2023-09-12 15:59:01', '2023-09-12 15:59:01')
---
    public function store(UploadImageRequest $request)
    {
        $imageFiles = $request->file('files');
        if(!is_null($imageFiles)){
            foreach($imageFiles as $imageFile){
                $fileNameToStore = ImageService::upload($imageFile, 'products');
                Image::create([
                    'owner_id' => Auth::id(),
                    'filename' => $fileNameToStore
                ]);

select * from `images` where `images`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $image = Image::findOrFail($id);