app/Http/Controllers/Owner/ProductController.php

select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
select * from `products` where `products`.`id` = '1' limit 1
select * from `shops` where `shops`.`id` = 1 limit 1
---
    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {

            $id = $request->route()->parameter('product');
            if(!is_null($id)){
            $productsOwnerId = Product::findOrFail($id)->shop->owner->id;

select * from `images` where `images`.`id` in (1, 2, 3, 4)
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
select * from `products` where `products`.`shop_id` = 1 and `products`.`shop_id` is not null
select * from `shops` where `shops`.`owner_id` = 1 and `shops`.`owner_id` is not null limit 1
---
    public function index()
    {
        //$products = Owner::findOrFail(Auth::id())->shop->product;

        $ownerInfo = Owner::with('shop.product.imageFirst')
        ->where('id',Auth::id())->get();