app/Http/Controllers/Owner/ShopController.php

select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
select * from `shops` where `owner_id` = 1
select * from `shops` where `shops`.`id` = '1' limit 1
---
    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {
            //dd($request->route()->parameter('shop'));
            //dd(Auth::id());

            $id = $request->route()->parameter('shop'); //shopのid取得
                if(!is_null($id)){ // null判定
                $shopsOwnerId = Shop::findOrFail($id)->owner->id;
                $shopId = (int)$shopsOwnerId; // キャスト 文字列→数値に型変換
                $ownerId = Auth::id();
                if($shopId !== $ownerId){ // 同じでなかったら
                abort(404); // 404画面表示
                }
                }

            return $next($request);
        });

select * from `shops` where `owner_id` = 1
---
    public function index()
    {
       //phpinfo();

        //$ownerId = Auth::id();
        $shops = Shop::where('owner_id',Auth::id())->get();

select * from `shops` where `shops`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $shop = Shop::findOrFail($id);

select * from `shops` where `shops`.`id` = '1' limit 1
---
    public function update(UploadImageRequest $request, $id)
    {
        $request->validate([
            'name' => 'required|string|max:50',
            'information' => 'required|string|max:1000',
            'is_selling' => 'required',
        ]);

        $imageFile = $request->image;
        if(!is_null($imageFile) && $imageFile->isValid() ){
            $fileNameToStore = ImageService::upload($imageFile, 'shops');
        }

        $shop = Shop::findOrFail($id);