app/Http/Controllers/Admin/OwnersController.php

    public function index()
    {
        //$date_now = Carbon::now();
        //$date_parse = Carbon::parse(now());
        //echo $date_now;
        //echo $date_parse;

        //$e_all = Owner::all();
        //$q_get = DB::table('owners')->select('name' , 'created_at')->get();
        //$q_first = DB::table('owners')->select('name')->first();

        //$c_test = collect([
        //    'name' =>'てすと'
        //]);



        //dd($e_all, $q_get,$q_first,$c_test);
        $owners = Owner::select('id','name' , 'email' , 'created_at')->get();
---
select `id`, `name`, `email`, `created_at` from `owners` where `owners`.`deleted_at` is null

    public function store(Request $request)
    {
        //$request->name;
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:owners'],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        Owner::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `owners` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('c', 'ctest@test.com', '$2y$10$j0wXxzdks.FiSCa6m5rH1e2DKHh0grmktPfKh0Skon9N2DuTtu6mu', '2023-09-08 14:20:18', '2023-09-08 14:20:18')

    public function edit($id)
    {
        $owner = Owner::findOrFail($id);
---
select * from `owners` where `owners`.`id` = '3' limit 1